# SetLayerEnableCutPl

## Description
Sets whether the cut plane of the layer is enabled.

```pascal
PROCEDURE SetLayerEnableCutPl(
				layer          : HANDLE;
				enableCutPlane : BOOLEAN);
```

```python

def vs.SetLayerEnableCutPl(layer, enableCutPlane):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|layer|HANDLE|The layer.|
|enableCutPlane|BOOLEAN|Whether the cut plane is enabled.|

## See Also
VS Functions:
GetLayerEnableCutPl

## Version
Availability: from Vectorworks 2017
## Category
* Layers